package CH06;

public class Notepad {

	public static void main(String[] args) {
		
		
	/*
	 상속
	 상속기본
	 Overriding
	 UpdownCasting
	 Upcasting : 상위클래스형 참조변수 = 하위클래스형 객체
	 - 상속관계의 모든 하위클래스 객체 생성시 상위클래스형 참조변수 바인딩
	 - 업캐스팅된 상태에서 하위클래스의 재정의된 메서드에 접근 가능
	 
	 추상클래스
	 -> 상위클래스가 미완성된 함수를 하나이상 포함하는 클래스
	 추상클래스 객체생성이 불가능하다.
	 하위클래스에서 미완성된 함수를 완성시켜야 객체 생성이 가능하다.
	 업캐스팅된 상태에서 추상클래스가 사용된다
	 
	 추상클래스를 사용한다는 의미 => 상위클래스를 업캐스팅해서 함수를 만들어 사용하겠다.
	 함수의 헤더를 고정으로 하위클래스가 '강제'로 해당 본문을 완성
	 
	 인터페이스
	 모든 속성 : public final static을 기본 - 기준값을 만들 때,
	 모든 기능 : 추상메서드				   - 강제성부여
	 구현 < 설계에 중점 , 공정이 하나 늘어나는 작업 , 결합도를 낮춤
	 
	 */
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		

	}

}
